==========
Pipeline that is just an expression
==========

system MySystem(
  1 + 1;
)
  
---

(source_file
  (system_declaration
    (name)
    (system_body
      (pipeline
        (binary_expression
          (number)
          (operator)
          (number))))))

==========
Pipeline with a pipe
==========

system MySystem(
  true
  | true;
)

---

(source_file
  (system_declaration
    (name)
    (system_body
      (pipeline
        (boolean)
        (pipe
          (boolean))))))

==========
Pipeline with an assignment
==========

system MySystem(
  true
  = myVar;
)

---

(source_file
  (system_declaration
    (name)
    (system_body
      (pipeline
        (boolean)
        (assignment
          (variable))))))


==========
Pipeline with a reduce
==========

system MySystem(
  true
  $ acc = acc + 1, 0;
)

---

(source_file
  (system_declaration
    (name)
    (system_body
      (pipeline
        (boolean)
        (reduce
          (variable)
          (binary_expression
            (variable)
            (operator)
            (number))
          (number))))))
